tutorials/pitzDaily/pitzDaily/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default backward;
}

gradSchemes
{
    default         leastSquares;
    grad(p)         Gauss leastSquaresSkewCorrected linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss leastSquaresSkewCorrected GammaVDC 0.5;
}

laplacianSchemes
{
    default         none;
    laplacian(nu,U) Gauss linear corrected;
    laplacian((sGamma*interpolate((1|A(U)))),p) Gauss linear corrected;
}

interpolationSchemes
{
    default none;
    interpolate(U) leastSquaresSkewCorrected linear;
    interpolate((1|A(U))) linear;
    interpolate(p) linear;
}

snGradSchemes
{
    default none;
}

fluxRequired
{
    p;
}

// ************************************************************************* //
